cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxh.svd
        <!-- REGISTER "MMC_INTR_RX" -->
        <register>
          <name>MMC_INTR_RX</name>
          <description>Receive Interrupt Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "B" -->
            <field>
              <name>B</name>
              <description>Bits of MMC_INTR_RX</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMC_INTR_TX" -->
        <register>
          <name>MMC_INTR_TX</name>
          <description>MMC Transmit Interrupt Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "B" -->
            <field>
              <name>B</name>
              <description>Bits of MMC_INTR_TX</description>
              <msb>24</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMC_INTR_MASK_RX" -->
        <register>
          <name>MMC_INTR_MASK_RX</name>
          <description>MMC Receive Interrupt Mask Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "B" -->
            <field>
              <name>B</name>
              <description>Bits of MMC_INTR_MASK_RX</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMC_INTR_MASK_TX" -->
        <register>
          <name>MMC_INTR_MASK_TX</name>
          <description>MMC Transmit Interrupt Mask Register </description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "B" -->
            <field>
              <name>B</name>
              <description>Bits of MMC_INTR_MASK_TX</description>
              <msb>24</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXOCTETCOUNT_GB" -->
        <register>
          <name>TXOCTETCOUNT_GB</name>
          <description>Number of bytes transmitted, exclusive of preamble and retried bytes, in good and bad frames</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXFRAMECOUNT_GB" -->
        <register>
          <name>TXFRAMECOUNT_GB</name>
          <description>Number of good and bad frames transmitted, exclusive of retried frames</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXBROADCASTFRAMES_G" -->
        <register>
          <name>TXBROADCASTFRAMES_G</name>
          <description>Number of good broadcast frames transmitted</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICASTFRAMES_G" -->
        <register>
          <name>TXMULTICASTFRAMES_G</name>
          <description>Number of good multicast frames transmitted</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX64OCTETS_GB" -->
        <register>
          <name>TX64OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length of 64 bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX65TO127OCTETS_GB" -->
        <register>
          <name>TX65TO127OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 65 and 127 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX128TO255OCTETS_GB" -->
        <register>
          <name>TX128TO255OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 128 and 255 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX256TO511OCTETS_GB" -->
        <register>
          <name>TX256TO511OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 256 and 511 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX512TO1023OCTETS_GB" -->
        <register>
          <name>TX512TO1023OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 512 and 1023 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
