cmsis-svd/cmsis-svd/data/Infineon/s6e2gkxh.svd
        <!-- REGISTER "PCRF" -->
        <register>
          <name>PCRF</name>
          <description>Pull-up Setting Register F</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description>Port input/output Direction Setting Register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000071F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDR0</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR0</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register>
          <name>DDR1</name>
          <description>Port input/output Direction Setting Register 1</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of DDR1</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDR1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of DDR1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of DDR1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of DDR1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDR1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDR1</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDR1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR2" -->
        <register>
          <name>DDR2</name>
          <description>Port input/output Direction Setting Register 2</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDR2</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR2</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR2</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDR2</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDR2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR3" -->
        <register>
          <name>DDR3</name>
          <description>Port input/output Direction Setting Register 3</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDR3</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of DDR3</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of DDR3</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of DDR3</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDR3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR3</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR3</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDR3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDR3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR3</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR3</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR4" -->
        <register>
          <name>DDR4</name>
          <description>Port input/output Direction Setting Register 4</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDR4</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of DDR4</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of DDR4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of DDR4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDR4</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR4</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR4</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDR4</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDR4</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR4</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR4</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR4</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR5" -->
        <register>
          <name>DDR5</name>
          <description>Port input/output Direction Setting Register 5</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "DDR6" -->
        <register>
          <name>DDR6</name>
          <description>Port input/output Direction Setting Register 6</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000400F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDR6</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR6</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR6</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
